1. Load sql module in jupyter notebook

In [ ]:
%load_ext sql

2. Connect to sqlite in jupyter notebook

In [ ]:
%sql sqlite://

### 1. The Computer Store

In [ ]:
%%sql

CREATE TABLE Manufacturers (
    Code INTEGER,
    Name VARCHER(255) NOT NULL,
    PRIMARY KEY (Code)
);

In [ ]:
%%sql
SELECT * FROM Manufacturers

In [ ]:
%%sql

CREATE TABLE Products (
    Code INTEGER,
    Name VARCHER(255) NOT NULL,
    Price DECIMAL NOT NULL,
    Manufacturer INTEGER NOT NULL,
    PRIMARY KEY(Code),
    FOREIGN KEY (Manufacturer) REFERENCES Manufacturers(Code)
)

In [ ]:
%%sql
INSERT INTO Manufacturers (Code,Name) VALUES(1, 'Sony');
INSERT INTO Manufacturers (Code, Name) VALUES(2, 'Creative Labs');
INSERT INTO Manufacturers (Code, Name) VALUES(3, 'Hewlett-Packard');
INSERT INTO Manufacturers (Code, Name) VALUES(4, 'Iomega');
INSERT INTO Manufacturers (Code, Name) VALUES (5, 'Fujitsu');
INSERT INTO Manufacturers (Code, Name) VALUES (6, 'Whinchester');

In [ ]:
%%sql
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (1, 'Hard drive', 240, 5);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (2, 'Memory',120,6);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (3, 'ZIP drive', 150,4);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (4, 'Floppy disk',5,6);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (5, 'Monitor',240,1);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (6, 'DVD drive',180, 2);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (7, 'CD drive',90,2);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (8, 'Printer',270, 3);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (9, 'Toner cartridge',66,3);
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (10, 'DVD burner',180,2);

(1) Select the name of all the products in the store.

In [ ]:
%%sql

SELECT Name
FROM Products;

(2) Select the names and the prices of all the products in the store.

In [ ]:
%%sql
SELECT Name, Price FROM Products;

(3) Select the name of the products with a price between $60 and $120

In [ ]:
%%sql
SELECT Name
FROM Products
WHERE Price >= 60 AND Price <= 200;

(4) Select the name and price in cents

In [ ]:
%%sql
SELECT Name, Price* 100 AS 'Price in Cents'
FROM Products;

(5)Compute the average price of all the products

In [ ]:
%%sql
SELECT AVG(Price) FROM Products;

(6) Compute the average price of all products with manufacturer code equal to 2.

In [ ]:
%%sql
SELECT AVG(Price) 
FROM Products
WHERE Manufacturer = 2;

(7) Compute the number of products with a price larger than or equal to $180

In [ ]:
%%sql
SELECT COUNT(DISTINCT Name)
FROM Products
WHERE Price >= 180;

(8) Select the name and price of all products with a price larget than or equal to 180, and sort first by price (in DESC order), and then by name (in ASC order)

In [ ]:
%%sql
SELECT Name, Price
FROM Products
WHERE Price >= 180
ORDER BY Price DESC, Name ASC;

(9) Select all the data from the products, including all the data for each product's manufacturer.

In [ ]:
%%sql
SELECT * FROM 
Products p JOIN Manufacturers m ON (p.Manufacturer = m.Code);

In [ ]:
%%sql
SELECT * FROM Products p, Manufacturers m
WHERE p.Manufacturer = m.Code;

(10) Select the product name, price and manufactuere of all the products.

In [ ]:
%%sql
SELECT p.Name, p.Price, m.Name
FROM Products p, Manufacturers m
WHERE p.Manufacturer = m.Code;

(11)Select the average price of each manufacturer's products, showing only the manufacturer's code

In [ ]:
%%sql
SELECT AVG(Price), Manufacturer
FROM Products
GROUP BY Manufacturer;

(12) Select the average price of each manufacturer's products, showing the manufacturer's name.

In [ ]:
%%sql
SELECT AVG(p.Price), m.Name
FROM Products p, Manufacturers m
WHERE p.Manufacturer = m.code
GROUP BY m.Name;

(13) Select the names of manufacturer whose products have an average price larger than or equal to $150.

In [ ]:
%%sql
SELECT m.Name, AVG(p.Price)
FROM Manufacturers m JOIN Products p
ON m.Code = p.Manufacturer
GROUP BY p.Manufacturer
HAVING AVG(p.Price) >= 150;

(14) Select the name and price of the cheapest product

In [ ]:
%%sql
SELECT Price, Name
FROM Products
ORDER BY Price
LIMIT 1;

In [ ]:
%%sql
SELECT Price, Name
FROM Products
WHERE Price = (SELECT MIN(Price) FROM Products);

(15) Select the name of each manufacturer along with the name and price of its most expensive product.

In [ ]:
%%sql
SELECT p.Name, p.Price, m.Name
FROM Products p INNER JOIN Manufacturers m
   ON p.Manufacturer = m.Code
     AND p.Price =
    (
       SELECT MAX(p.Price)
         FROM Products p
         WHERE p.Manufacturer = m.Code
     );

In [ ]:
%%sql

SELECT pp.Price, m.Name
FROM Manufacturers m JOIN 
( SELECT MAX(p.Price) as Price, p.Code, p.Manufacturer FROM Products p
    GROUP BY p.Code
) pp
ON pp.Manufacturer = m.Code
AND pp.Price =

(16) Add a new product: Loudspeakers, $70, manufacturer 2.

In [ ]:
%%sql
INSERT INTO Products (Code, Name, Price, Manufacturer) VALUES (11, 'Loudspeakers',70,2)

(17) Update the name of product 8 to 'Laser Printer'

In [ ]:
%%sql
UPDATE Products
SET Name = 'Laser Printer'
WHERE Code = 8;

(18) Apply a 10% discount to all products.

In [ ]:
%%sql
UPDATE Products
SET Price = Price * 0.9;

(19) Apply a 10% discount to all products with a price higher than or equal to $120

In [ ]:
%%sql
UPDATE Products
SET Price = Price * 0.9
WHERE Price >= 120;

### 2. Employee Management

In [ ]:
%%sql
CREATE TABLE Departments (
    Code INTEGER NOT NULL,
    Name TEXT NOT NULL,
    Budget REAL NOT NULL,
    PRIMARY KEY (Code));

In [ ]:
%%sql
CREATE TABLE Employees (
    SSN INTEGER PRIMARY KEY,
    Name TEXT NOT NULL,
    LastName TEXT NOT NULL,
    Department INTEGER NOT NULL,
    FOREIGN KEY (Department) REFERENCES Departments(Code)
    );

In [ ]:
%%sql
INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

In [ ]:
%%sql
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','O''Donnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);

(1) Select the last name of all employees

In [ ]:
%%sql
SELECT LastName FROM Employees;

(2) Select the last name of all employees, without duplicates

In [ ]:
%%sql
SELECT DISTINCT(LastName) FROM Employees;

(3) Select all the data of employees whose last name is 'Smith'

In [ ]:
%%sql
SELECT * FROM Employees WHERE LastName = 'Smith';

(4) Select all the data of employees whose last name is 'Smith' or 'Doe'

In [ ]:
%%sql
SELECT * FROM Employees WHERE LastName in ('Smith', 'Doe');

(5) Select all the data of employees that work in department 14

In [ ]:
%%sql
SELECT * FROM Employees WHERE Department = 14;

(6) Select all the data of employees what work in the department 37 or department 77

In [ ]:
%%sql
SELECT * FROM Employees WHERE Department in (37,77);

(7) Select all the data of employees whose last name begins with an 'S'

In [ ]:
%%sql
SELECT * FROM Employees WHERE LastName LIKE 'S%';

(8) Select the sum of all the departments' budget

In [ ]:
%%sql
SELECT SUM(Budget) FROM Departments;

(9) Select the number of employees in each department (you only need to show the department code and the number of employees)

In [ ]:
%%sql
SELECT COUNT(*), Department FROM Employees GROUP BY Department;

(10) Select all the data of employees, including each employee's department data.

In [ ]:
%%sql
SELECT e.*,d.*
FROM Employees e JOIN Departments d ON e.Department = d.Code;

(11) Select the name and last name of each employee, along with the name and budget of the employee's department

In [ ]:
%%sql
SELECT e.Name || ' ' ||e.LastName, d.Name, d.Budget
FROM Employees e JOIN Departments d
ON e.Department = d.Code;

(12) Select the name and last name of employees working for departments with a budget greater than $60000.

In [ ]:
%%sql
SELECT e.Name || ' '|| e.LastName AS 'Name', d.Name, d.Budget
FROM Employees e JOIN Departments d
ON e.Department = d.Code
WHERE d.Budget >= 60000;

(13) Select the departments with a budget larger than the average budget of all the departments.

In [ ]:
%%sql
SELECT Name, Budget
FROM Departments
WHERE Budget >
    (SELECT AVG(Budget) FROM Departments
    );

(14) Select the names of departments with more than two employees

In [ ]:
%%sql
SELECT d.name
FROM Departments d JOIN 
    (SELECT Department
     FROM Employees 
     GROUP BY Department
     HAVING COUNT(SSN) > 2
    ) e
ON d.Code = e.Department;

In [ ]:
%%sql
SELECT Name FROM Departments
  WHERE Code IN
(SELECT Department FROM Employees
      GROUP BY Department
      HAVING COUNT(*) > 2
  );

In [ ]:
%%sql
SELECT Departments.Name
  FROM Employees INNER JOIN Departments
    ON Department = Code
    GROUP BY Departments.Name
    HAVING COUNT(*) > 2;

(15) Select the name and last name of employees working for departments with second lowest budget.

In [ ]:
%%sql
SELECT Name || ' ' || LastName
FROM Employees
WHERE Department IN (
    SELECT Code
    FROM 
        (SELECT * FROM Departments ORDER BY Budget LIMIT 2)
    ORDER BY Budget DESC
    LIMIT 1);

(16) Add a new department called 'Quality Assurance', with a budget of $40000 and department code 11. Add an employee called 'Mary Morre' in that department, with SSN 847-21-9811.

In [ ]:
%%sql
INSERT INTO Departments
  VALUES ( 11 , 'Quality Assurance' , 40000);

INSERT INTO Employees
  VALUES ( '847219811' , 'Mary' , 'Moore' , 11);

(17) Reduce the budget of all departments by 10%

In [ ]:
%%sql
UPDATE Departments
SET Budget = Budget * 0.9;

(18) Reassign all employees from the research department (code 77) to the IT Depertment (code 14)

In [ ]:
%%sql
UPDATE Employees
SET Department = 14
WHERE Department = 77;

(19) Delete from the table all employees in the IT deprtment (code 14)

In [ ]:
%%sql
DELETE FROM Employees WHERE Department = 14;

(20) Delete from the table all employees who work in departments with a budget greater than or equal to $60000.

In [ ]:
%%sql
DELETE FROM Employees
  WHERE Department IN
(
    SELECT Code FROM Departments
      WHERE Budget >= 60000
  );

(21) Delete from the table all employees

In [ ]:
%%sql
DELETE FROM Employees;

In [ ]:
%%sql
SELECT * FROM Employees;

### 3. The Warehouse

In [ ]:
%%sql
CREATE TABLE Warehouses (
    Code INTEGER PRIMARY KEY NOT NULL,
    Location TEXT NOT NULL,
    Capacity INTEGER NOT NULL);

In [ ]:
%%sql
CREATE TABLE Boxes(
    Code TEXT PRIMARY KEY NOT NULL,
    Contents TEXT NOT NULL,
    Value REAL NOT NULL,
    Warehouse INTEGER NOT NULL,
    FOREIGN KEY(Warehouse) REFERENCES Warehouses(Code))

In [ ]:
%%sql
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(1,'Chicago',3);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(2,'Chicago',4);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(3,'New York',7);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(4,'Los Angeles',2);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(5,'San Francisco',8);
 
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('0MN7','Rocks',180,3);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4H8P','Rocks',250,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4RT3','Scissors',190,4);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('7G3H','Rocks',200,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8JN6','Papers',75,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8Y6U','Papers',50,3);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('9J6F','Papers',175,2);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('LL08','Rocks',140,4);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P0H6','Scissors',125,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P2T6','Scissors',150,2);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('TU55','Papers',90,5);

(1) Select all warehouses

In [ ]:
%%sql
SELECT * FROM Warehouses;

(2) Select all boxes with a value larger then $150

In [ ]:
%%sql
SELECT * FROM Boxes
WHERE Value >= 150;

(3)Select all distinct contents in all the boxes

In [ ]:
%%sql
SELECT DISTINCT Contents FROM Boxes

(4) Select the average value of all the boxes

In [ ]:
%%sql
SELECT ROUND(AVG(Value),2) FROM Boxes;

(5) Select the warehouse code and average value of the boxes in each warehouse

In [ ]:
%%sql
SELECT Warehouse, AVG(Value)
FROM Boxes
GROUP BY Warehouse;

(6) Same as previous exercise, but select only those warehouses where the average value of the boxes is greater than 150

In [ ]:
%%sql
SELECT Warehouse, AVG(Value)
FROM Boxes
GROUP BY Warehouse
HAVING AVG(Value) > 150;

(7) Select the code of each box, along with the name of the city the box is located in.

In [ ]:
%%sql
SELECT b.Code, w.Location
FROM Boxes b JOIN Warehouses w
ON b.Warehouse = w.Code;

(8)Select the warehouse codes, along with the bumber of boxes in each warehouse. Optionally, take into account that some warehouses are empty (i.e, the box count should show up as zero, instead of omitting the warehouse from the reuslt)

In [ ]:
%%sql
SELECT w.Code, COUNT(b.Code)
FROM Warehouses w JOIN Boxes b
ON w.Code = b.Warehouse
GROUP BY w.Code

(9) Select the codes of all warehouses that are saturated (a warehouse is saturated if the number of boxes in it is larger than the warehouse's capacity)

In [ ]:
%%sql
SELECT w.Code, COUNT(b.Code),w.Capacity
FROM Warehouses w JOIN Boxes b
ON w.Code = b.Warehouse
GROUP BY w.Code
HAVING COUNT(b.Code) > w.Capacity;

In [ ]:
%%sql
SELECT Code
FROM Warehouses
WHERE Capacity <
   (
     SELECT COUNT(*)
     FROM Boxes
     WHERE Warehouse = Warehouses.Code
   );

(10) Select the codes of all the boxes located in Chicago.

In [ ]:
%%sql
SELECT b.Code, w.Location
FROM Boxes b JOIN Warehouses w
ON b.Warehouse = w.Code
WHERE w.Location = 'Chicago';

In [ ]:
%%sql
SELECT Code
FROM Boxes
WHERE Warehouse IN (
    SELECT Code
    FROM Warehouses
    WHERE Location = 'Chicago');

(11) Create a new warehouse in New York with a capacity for 3 boxes.

In [ ]:
%%sql
INSERT INTO Warehouses (Location, Capacity) VALUES ('New York',3);

(12) Create a new box, with code 'H5RT', containing 'Papers' with a value of $200, and lcoatied in warehouse 2.

In [ ]:
%%sql
INSERT INTO Boxes VALUES ('H5RT','Papers',200,2);

(13) Reduce the value of all boxes by 15%

In [ ]:
%%sql
UPDATE Boxes
SET Value = Value * (1-0.15);Any repeat loan created within 1 month of the first

(14) Apply a 20% value reduction to boxes with a value larget than the average value of all the boxes

In [ ]:
%%sql
UPDATE Boxes
SET Value = Value * (1-0.2)
WHERE Value > (
    SELECT AVG(Value)
    FROM Boxes);

(15) Remove all boxes with a value lower than $100

In [ ]:
%%sql
DELETE FROM Boxes
WHERE Value < 100;

(16) Remove all boxes from saturated warehouses

In [ ]:
%%sql
DELETE FROM Boxes
WHERE Warehouse IN (
    SELECT Code
    FROM Warehouses
    WHERE Capacity < (
        SELECT COUNT(Code)
        FROM Boxes
        GROUP BY Warehouse));

In [ ]:
%%sql
 DELETE FROM Boxes WHERE Warehouse IN
(
     SELECT Code
       FROM Warehouses
       WHERE Capacity <
       (
         SELECT COUNT(*)
           FROM Boxes
           WHERE Warehouse = Warehouses.Code
       )
   );

### 4. Movie Theatres

In [ ]:
%%sql
CREATE TABLE Movies(
Code INTEGER PRIMARY KEY NOT NULL,
Title TEXT NOT NULL,
Rating TEXT);

In [ ]:
%%sql
CREATE TABLE MovieTheaters (
CODE INTEGER PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
Movie INTEGER,
FOREIGN KEY(Movie) REFERENCES Movies(Code));

In [ ]:
%%sql
INSERT INTO Movies(Code,Title,Rating) VALUES(9,'Citizen King','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(1,'Citizen Kane','PG');
INSERT INTO Movies(Code,Title,Rating) VALUES(2,'Singin'' in the Rain','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(3,'The Wizard of Oz','G');
INSERT INTO Movies(Code,Title,Rating) VALUES(4,'The Quiet Man',NULL);
INSERT INTO Movies(Code,Title,Rating) VALUES(5,'North by Northwest',NULL);
INSERT INTO Movies(Code,Title,Rating) VALUES(6,'The Last Tango in Paris','NC-17');
INSERT INTO Movies(Code,Title,Rating) VALUES(7,'Some Like it Hot','PG-13');
INSERT INTO Movies(Code,Title,Rating) VALUES(8,'A Night at the Opera',NULL);
 
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(1,'Odeon',5);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(2,'Imperial',1);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(3,'Majestic',NULL);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(4,'Royale',6);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(5,'Paraiso',3);
INSERT INTO MovieTheaters(Code,Name,Movie) VALUES(6,'Nickelodeon',NULL);

(1) Select the title of all movies

In [ ]:
%%sql
SELECT Title FROM Movies;

(2) Show all the distint ratings in the database;

In [ ]:
%%sql
SELECT DISTINCT Rating FROM Movies;

(3) Show all unrated movies.

In [ ]:
%%sql
SELECT * FROM Movies WHERE Rating IS NULL;

(4)Select all movies theaters that are not currently showing a movie

In [ ]:
%%sql
SELECT * FROM MovieTheaters WHERE Movie IS NULL;

(5) Select all data from all movie theaters and, additionally, the data from the movie that is being shown in the theater (if one is being shown)

In [ ]:
%%sql
SELECT t.*, m.*
FROM MovieTheaters t LEFT JOIN Movies m
ON t.Movie = m.Code;

(6) Select all data from all movies and, if that movie is being shown in a theater, show the data from the theater.

In [ ]:
%%sql
SELECT t.*, m.*
FROM MovieTheaters t RIGHT JOIN Movies m
ON t.Movie = m.Code;

(7) Show the titles of movies not currently being shown in any theaters

In [ ]:
%%sql
SELECT m.* , t.Name
FROM Movies m LEFT JOIN MovieTheaters t
ON m.Code = t.Movie
WHERE t.Movie IS NULL;

In [ ]:
%%sql
SELECT Title FROM Movies
   WHERE Code NOT IN
(
     SELECT Movie FROM MovieTheaters
     WHERE Movie IS NOT NULL
   );

(8) Add the unrated movie 'One, Two, Three'

In [ ]:
%%sql
INSERT INTO Movies (Title,Rating)
VALUES ('One, Two, Three', NULL);

(9) Set the rating of all unrated movies to 'G'

In [ ]:
%%sql
UPDATE Movies
SET Rating = 'G'
WHERE Rating IS NULL;

(10) Remove movie theaters project movies rated 'NC-17'

In [ ]:
%%sql
DELETE FROM MovieTheaters
WHERE Movie in (
    SELECT Code
    FROM Movies
    WHERE Rating = 'NC-17');

### 5. Pieces and Providers

In [ ]:
%%sql
CREATE TABLE Pieces (
    Code INTEGER PRIMARY KEY NOT NULL,
    Name TEXT NOT NULL);

In [ ]:
%%sql
CREATE TABLE Providers (
    Code TEXT PRIMARY KEY NOT NULL,
    NAME TEXT NOT NULL)

In [ ]:
%%sql
CREATE TABLE Provides (
    Piece INTEGER CONSTRAINT fk_Pieces_Code REFERENCES Pieces(Code),
    Provider TEXT CONSTRAINT fk_Providers_Code REFERENCES Providers(Code),
    Price INTEGER NOT NULL,
    PRIMARY KEY (Piece, Provider)
)

In [ ]:
%%sql
INSERT INTO Providers(Code, Name) VALUES('HAL','Clarke Enterprises');
INSERT INTO Providers(Code, Name) VALUES('RBT','Susan Calvin Corp.');
INSERT INTO Providers(Code, Name) VALUES('TNBC','Skellington Supplies');

In [ ]:
%%sql
INSERT INTO Pieces(Code, Name) VALUES(1,'Sprocket');
INSERT INTO Pieces(Code, Name) VALUES(2,'Screw');
INSERT INTO Pieces(Code, Name) VALUES(3,'Nut');
INSERT INTO Pieces(Code, Name) VALUES(4,'Bolt');

In [ ]:
%%sql
INSERT INTO Provides(Piece, Provider, Price) VALUES(1,'HAL',10);
INSERT INTO Provides(Piece, Provider, Price) VALUES(1,'RBT',15);
INSERT INTO Provides(Piece, Provider, Price) VALUES(2,'HAL',20);
INSERT INTO Provides(Piece, Provider, Price) VALUES(2,'RBT',15);
INSERT INTO Provides(Piece, Provider, Price) VALUES(2,'TNBC',14);
INSERT INTO Provides(Piece, Provider, Price) VALUES(3,'RBT',50);
INSERT INTO Provides(Piece, Provider, Price) VALUES(3,'TNBC',45);
INSERT INTO Provides(Piece, Provider, Price) VALUES(4,'HAL',5);
INSERT INTO Provides(Piece, Provider, Price) VALUES(4,'RBT',7);

(1) Select the name of all the pieces.

In [ ]:
%%sql
SELECT name FROM Pieces;

(2) Select all the providers' data.

In [ ]:
%%sql
SELECT * FROM Providers

(3) Obtain the average price of each piece.

In [ ]:
%%sql
SELECT Piece, ROUND(AVG(Price),2) 'Avg' FROM Provides
GROUP BY Piece;

(4) Obtain the names of all providers who supply piece 1.

In [ ]:
%%sql
SELECT p1.Name, p2.Provider
FROM Providers p1, Provides p2
WHERE p1.Code = p2.Provider AND
    p2.Piece = 1;

In [ ]:
%%sql
SELECT Name
    FROM Providers
    WHERE Code IN
    (SELECT Provider FROM Provides WHERE Piece = 1);

(5) Select the name of pieces provided by provider with code 'HAL'

In [ ]:
%%sql
SELECT Name
FROM Pieces
WHERE Code IN (
    SELECT Piece
    FROM Provides
    WHERE Provider = 'HAL');

(6) For each piece, find the most expensive offering of that piece and include the piece name, provider name, and price. (Note that there could be two providers who supply the same piece at the most expensive price)

In [ ]:
%%sql
SELECT Pieces.Name, Providers.Name, Price
FROM Pieces INNER JOIN Provides ON Pieces.Code = Piece
               INNER JOIN Providers ON Providers.Code = Provider
WHERE Price =
(
    SELECT MAX(Price) FROM Provides
    WHERE Piece = Pieces.Code
   );

(7) Add an entry to the database to indicate that "Skellington Supplies" (code "TNBC") will provide sprockets (code "1") for 7 cents each.

In [ ]:
%%sql
INSERT INTO Provides 
  VALUES (1, 'TNBC', 7);

(8) Increase all prices by one cent.

In [ ]:
%%sql
UPDATE Provides SET Price = Price + 1;

(9)Update the database to reflect that "Susan Calvin Corp." (code "RBT") will not supply bolts (code 4).

In [ ]:
%%sql
 DELETE FROM Provides
    WHERE Provider = 'RBT'
     AND Piece = 4;

(10) Update the database to reflect that "Susan Calvin Corp." (code "RBT") will not supply any pieces (the provider should still remain in the database).

In [ ]:
%%sql
DELETE FROM Provides
   WHERE Provider = 'RBT';

### Scientists

In [ ]:
%%sql
CREATE TABLE Scientists (
    SSN int,
    Name Chart(30) NOT NULL,
    Primary Key (SSN));

In [ ]:
%%sql
CREATE TABLE Projects (
    Code CHAR(4),
    Name CHAR (50) NOT NULL,
    Hours INT,
    Primary Key (Code));

In [ ]:
%%sql
CREATE TABLE AssignedTo(
    Scientist INT NOT NULL,
    Project CHAR(4) NOT NULL,
    Primary Key (Scientist, Project),
    Foreign Key (Scientist) REFERENCES Scientists(SSN),
    Foreign Key (Project) REFERENCES Projects(Code));

In [ ]:
%%sql
INSERT INTO Scientists(SSN,Name) 
  VALUES(123234877,'Michael Rogers'),
    (152934485,'Anand Manikutty'),
    (222364883, 'Carol Smith'),
    (326587417,'Joe Stevens'),
    (332154719,'Mary-Anne Foster'),	
    (332569843,'George ODonnell'),
    (546523478,'John Doe'),
    (631231482,'David Smith'),
    (654873219,'Zacary Efron'),
    (745685214,'Eric Goldsmith'),
    (845657245,'Elizabeth Doe'),
    (845657246,'Kumar Swamy');

In [ ]:
%%sql
INSERT INTO Projects ( Code,Name,Hours)
 VALUES ('AeH1','Winds: Studying Bernoullis Principle', 156),
    ('AeH2','Aerodynamics and Bridge Design',189),
    ('AeH3','Aerodynamics and Gas Mileage', 256),
    ('AeH4','Aerodynamics and Ice Hockey', 789),
    ('AeH5','Aerodynamics of a Football', 98),
    ('AeH6','Aerodynamics of Air Hockey',89),
    ('Ast1','A Matter of Time',112),
    ('Ast2','A Puzzling Parallax', 299),
    ('Ast3','Build Your Own Telescope', 6546),
    ('Bte1','Juicy: Extracting Apple Juice with Pectinase', 321),
    ('Bte2','A Magnetic Primer Designer', 9684),
    ('Bte3','Bacterial Transformation Efficiency', 321),
    ('Che1','A Silver-Cleaning Battery', 545),
    ('Che2','A Soluble Separation Solution', 778);

In [ ]:
%%sql
INSERT INTO AssignedTo ( Scientist, Project)
   VALUES (123234877,'AeH1'),
    (152934485,'AeH3'),
    (222364883,'Ast3'),	   
    (326587417,'Ast3'),
    (332154719,'Bte1'),
    (546523478,'Che1'),
    (631231482,'Ast3'),
    (654873219,'Che1'),
    (745685214,'AeH3'),
    (845657245,'Ast1'),
    (845657246,'Ast2'),
    (332569843,'AeH4');

List all the scientists' names, their projects'names, and the hours worked by that scientist on each project, in alphabetical order of project name, then scientist name.

In [ ]:
%%sql
SELECT s.*,a.*,p.*
FROM Scientists s JOIN AssignedTo a ON s.SSN = a.Scientist
    JOIN Projects p ON a.Project = p.Code
ORDER BY p.Name, s.Name

### Planet Express

<img src="//upload.wikimedia.org/wikipedia/commons/c/c0/Planet-express-db.png"> </img>

In [ ]:
%%sql
CREATE TABLE Employee (
   EmployeeID INTEGER PRIMARY KEY NOT NULL,
   Name TEXT NOT NULL,
   Position TEXT NOT NULL,
   Salary REAL NOT NULL,
   Remarks TEXT
 );

In [ ]:
%%sql
CREATE TABLE Planet (
   PlanetID INTEGER PRIMARY KEY NOT NULL,
   Name TEXT NOT NULL,
   Coordinates REAL NOT NULL
 );

In [ ]:
%%sql
CREATE TABLE Shipment (
    ShipmentID INTEGER PRIMARY KEY NOT NULL,
    Date TEXT,
    Manager INTEGER NOT NULL
    CONSTRAINT fk_Employee_EmployeeID REFERENCES Employee(EmployeeID),
    Planet INTEGER NOT NULL
    CONSTRAINT fk_Planet_PlanetID REFERENCES Planet(PlanetID));

In [ ]:
%%sql
CREATE TABLE Has_Clearance (
    Employee INTEGER NOT NULL
    CONSTRAINT fk_Employee_EmployeeID REFERENCES Employee(EmployeeID),
    Planet INTEGER NOT NULL
    CONSTRAINT fk_Planet_PlanetID REFERENCES Planet(PlanetID),
    Level INTEGER NOT NULL,
    PRIMARY KEY(Employee, Planet)
    );

In [ ]:
%%sql
CREATE TABLE Client(
    AccountNumber INTEGER PRIMARY KEY NOT NULL,
    Name TEXT NOT NULL);

In [ ]:
%%sql
CREATE TABLE Package (
    Shipment INTEGER NOT NULL
    CONSTRAINT fk_Shipment_ShipmentID REFERENCES Shipment(ShipmentID),
    PackageNumber INTEGER NOT NULL,
    Contents TEXT NOT NULL,
    Weight REAL NOT NULL,
    Sender INTEGER NOT NULL
    CONSTRAINT fk_Client_AccountNumber REFERENCES Client(AccountNumber),
    Recipient INTEGER NOT NULL
    CONSTRAINT fk_Client_AccountNumber REFERENCES Client(AccountNumber),
    PRIMARY KEY (Shipment, PackageNumber));

In [ ]:
%%sql
INSERT INTO Client VALUES(1, 'Zapp Brannigan');
INSERT INTO Client VALUES(2, 'Al Gore‘’s Head');
INSERT INTO Client VALUES(3, 'Barbados Slim');
INSERT INTO Client VALUES(4, 'Ogden Wernstrom');
INSERT INTO Client VALUES(5, 'Leo Wong');
INSERT INTO Client VALUES(6, 'Lrrr');
INSERT INTO Client VALUES(7, 'John Zoidberg');
INSERT INTO Client VALUES(8, 'John Zoidfarb');
INSERT INTO Client VALUES(9, 'Morbo');
INSERT INTO Client VALUES(10, 'Judge John Whitey');
INSERT INTO Client VALUES(11, 'Calculon');
INSERT INTO Employee VALUES(1, 'Phillip J. Fry', 'Delivery boy', 7500.0, 'Not to be confused with the Philip J. Fry from Hovering Squid World 97a');
INSERT INTO Employee VALUES(2, 'Turanga Leela', 'Captain', 10000.0, NULL);
INSERT INTO Employee VALUES(3, 'Bender Bending Rodriguez', 'Robot', 7500.0, NULL);
INSERT INTO Employee VALUES(4, 'Hubert J. Farnsworth', 'CEO', 20000.0, NULL);
INSERT INTO Employee VALUES(5, 'John A. Zoidberg', 'Physician', 25.0, NULL);
INSERT INTO Employee VALUES(6, 'Amy Wong', 'Intern', 5000.0, NULL);
INSERT INTO Employee VALUES(7, 'Hermes Conrad', 'Bureaucrat', 10000.0, NULL);
INSERT INTO Employee VALUES(8, 'Scruffy Scruffington', 'Janitor', 5000.0, NULL);
INSERT INTO Planet VALUES(1, 'Omicron Persei 8', 89475345.3545);
INSERT INTO Planet VALUES(2, 'Decapod X', 65498463216.3466);
INSERT INTO Planet VALUES(3, 'Mars', 32435021.65468);
INSERT INTO Planet VALUES(4, 'Omega III', 98432121.5464);
INSERT INTO Planet VALUES(5, 'Tarantulon VI', 849842198.354654);
INSERT INTO Planet VALUES(6, 'Cannibalon', 654321987.21654);
INSERT INTO Planet VALUES(7, 'DogDoo VII', 65498721354.688);
INSERT INTO Planet VALUES(8, 'Nintenduu 64', 6543219894.1654);
INSERT INTO Planet VALUES(9, 'Amazonia', 65432135979.6547);
INSERT INTO Has_Clearance VALUES(1, 1, 2);
INSERT INTO Has_Clearance VALUES(1, 2, 3);
INSERT INTO Has_Clearance VALUES(2, 3, 2);
INSERT INTO Has_Clearance VALUES(2, 4, 4);
INSERT INTO Has_Clearance VALUES(3, 5, 2);
INSERT INTO Has_Clearance VALUES(3, 6, 4);
INSERT INTO Has_Clearance VALUES(4, 7, 1);
INSERT INTO Shipment VALUES(1, '3004/05/11', 1, 1);
INSERT INTO Shipment VALUES(2, '3004/05/11', 1, 2);
INSERT INTO Shipment VALUES(3, NULL, 2, 3);
INSERT INTO Shipment VALUES(4, NULL, 2, 4);
INSERT INTO Shipment VALUES(5, NULL, 7, 5);
INSERT INTO Package VALUES(1, 1, 'Undeclared', 1.5, 1, 2);
INSERT INTO Package VALUES(2, 1, 'Undeclared', 10.0, 2, 3);
INSERT INTO Package VALUES(2, 2, 'A bucket of krill', 2.0, 8, 7);
INSERT INTO Package VALUES(3, 1, 'Undeclared', 15.0, 3, 4);
INSERT INTO Package VALUES(3, 2, 'Undeclared', 3.0, 5, 1);
INSERT INTO Package VALUES(3, 3, 'Undeclared', 7.0, 2, 3);
INSERT INTO Package VALUES(4, 1, 'Undeclared', 5.0, 4, 5);
INSERT INTO Package VALUES(4, 2, 'Undeclared', 27.0, 1, 2);
INSERT INTO Package VALUES(5, 1, 'Undeclared', 100.0, 5, 1);

(1) Who received a 1.5KG Package?

In [ ]:
%%sql
SELECT Name,AccountNumber
FROM Client
WHERE AccountNumber IN (
    SELECT Recipient
    FROM Package
    WHERE Weight = 1.5);

(2) What is the total weight of all the packages that he sent

In [ ]:
%%sql
SELECT SUM(Weight)
FROM Package
WHERE Sender IN
(SELECT Recipient
FROM Package
WHERE Recipient IN (
    SELECT Recipient
    FROM Package
    WHERE Weight = 1.5));

(3) Which pilots transported those packages?

In [ ]:
%%sql
SELECT Name
FROM Employee
WHERE EmployeeID IN
    (SELECT Manager
    FROM Shipment
    WHERE ShipmentID IN
        (SELECT Shipment
        FROM Package
        WHERE Sender IN
            (SELECT Recipient
            FROM Package
            WHERE Weight = 1.5)));

### The Hospital

<img src="//upload.wikimedia.org/wikipedia/commons/b/b8/Sql_hospital.png"></img>

In [ ]:
%%sql
CREATE TABLE Physician (
  EmployeeID INTEGER PRIMARY KEY NOT NULL,
  Name TEXT NOT NULL,
  Position TEXT NOT NULL,
  SSN INTEGER NOT NULL
); 

CREATE TABLE Department (
  DepartmentID INTEGER PRIMARY KEY NOT NULL,
  Name TEXT NOT NULL,
  Head INTEGER NOT NULL
    CONSTRAINT fk_Physician_EmployeeID REFERENCES Physician(EmployeeID)
);

CREATE TABLE Affiliated_With (
  Physician INTEGER NOT NULL
    CONSTRAINT fk_Physician_EmployeeID REFERENCES Physician(EmployeeID),
  Department INTEGER NOT NULL
    CONSTRAINT fk_Department_DepartmentID REFERENCES Department(DepartmentID),
  PrimaryAffiliation BOOLEAN NOT NULL,
  PRIMARY KEY(Physician, Department)
);

CREATE TABLE Procedure (
  Code INTEGER PRIMARY KEY NOT NULL,
  Name TEXT NOT NULL,
  Cost REAL NOT NULL
);

CREATE TABLE Trained_In (
  Physician INTEGER NOT NULL
    CONSTRAINT fk_Physician_EmployeeID REFERENCES Physician(EmployeeID),
  Treatment INTEGER NOT NULL
    CONSTRAINT fk_Procedure_Code REFERENCES Procedure(Code),
  CertificationDate DATETIME NOT NULL,
  CertificationExpires DATETIME NOT NULL,
  PRIMARY KEY(Physician, Treatment)
);

CREATE TABLE Patient (
  SSN INTEGER PRIMARY KEY NOT NULL,
  Name TEXT NOT NULL,
  Address TEXT NOT NULL,
  Phone TEXT NOT NULL,
  InsuranceID INTEGER NOT NULL,
  PCP INTEGER NOT NULL
    CONSTRAINT fk_Physician_EmployeeID REFERENCES Physician(EmployeeID)
);

CREATE TABLE Nurse (
  EmployeeID INTEGER PRIMARY KEY NOT NULL,
  Name TEXT NOT NULL,
  Position TEXT NOT NULL,
  Registered BOOLEAN NOT NULL,
  SSN INTEGER NOT NULL
);

CREATE TABLE Appointment (
  AppointmentID INTEGER PRIMARY KEY NOT NULL,
  Patient INTEGER NOT NULL
    CONSTRAINT fk_Patient_SSN REFERENCES Patient(SSN),
  PrepNurse INTEGER
    CONSTRAINT fk_Nurse_EmployeeID REFERENCES Nurse(EmployeeID),
  Physician INTEGER NOT NULL
    CONSTRAINT fk_Physician_EmployeeID REFERENCES Physician(EmployeeID),
  Start DATETIME NOT NULL,
  End DATETIME NOT NULL,
  ExaminationRoom TEXT NOT NULL
);

CREATE TABLE Medication (
  Code INTEGER PRIMARY KEY NOT NULL,
  Name TEXT NOT NULL,
  Brand TEXT NOT NULL,
  Description TEXT NOT NULL
);

CREATE TABLE Prescribes (
  Physician INTEGER NOT NULL
    CONSTRAINT fk_Physician_EmployeeID REFERENCES Physician(EmployeeID),
  Patient INTEGER NOT NULL
    CONSTRAINT fk_Patient_SSN REFERENCES Patient(SSN),
  Medication INTEGER NOT NULL
    CONSTRAINT fk_Medication_Code REFERENCES Medication(Code),
  Date DATETIME NOT NULL,
  Appointment INTEGER
    CONSTRAINT fk_Appointment_AppointmentID REFERENCES Appointment(AppointmentID),
  Dose TEXT NOT NULL,
  PRIMARY KEY(Physician, Patient, Medication, Date)
);

CREATE TABLE Block (
  Floor INTEGER NOT NULL,
  Code INTEGER NOT NULL,
  PRIMARY KEY(Floor, Code)
); 

CREATE TABLE Room (
  Number INTEGER PRIMARY KEY NOT NULL,
  Type TEXT NOT NULL,
  BlockFloor INTEGER NOT NULL
    CONSTRAINT fk_Block_Floor REFERENCES Block(Floor),
  BlockCode INTEGER NOT NULL
    CONSTRAINT fk_Block_Code REFERENCES Block(Code),
  Unavailable BOOLEAN NOT NULL
);

CREATE TABLE On_Call (
  Nurse INTEGER NOT NULL
    CONSTRAINT fk_Nurse_EmployeeID REFERENCES Nurse(EmployeeID),
  BlockFloor INTEGER NOT NULL
    CONSTRAINT fk_Block_Floor REFERENCES Block(Floor),
  BlockCode INTEGER NOT NULL
    CONSTRAINT fk_Block_Code REFERENCES Block(Code),
  Start DATETIME NOT NULL,
  End DATETIME NOT NULL,
  PRIMARY KEY(Nurse, BlockFloor, BlockCode, Start, End)
);

CREATE TABLE Stay (
  StayID INTEGER PRIMARY KEY NOT NULL,
  Patient INTEGER NOT NULL
    CONSTRAINT fk_Patient_SSN REFERENCES Patient(SSN),
  Room INTEGER NOT NULL
    CONSTRAINT fk_Room_Number REFERENCES Room(Number),
  Start DATETIME NOT NULL,
  End DATETIME NOT NULL
);

CREATE TABLE Undergoes (
  Patient INTEGER NOT NULL
    CONSTRAINT fk_Patient_SSN REFERENCES Patient(SSN),
  Procedure INTEGER NOT NULL
    CONSTRAINT fk_Procedure_Code REFERENCES Procedure(Code),
  Stay INTEGER NOT NULL
    CONSTRAINT fk_Stay_StayID REFERENCES Stay(StayID),
  Date DATETIME NOT NULL,
  Physician INTEGER NOT NULL
    CONSTRAINT fk_Physician_EmployeeID REFERENCES Physician(EmployeeID),
  AssistingNurse INTEGER
    CONSTRAINT fk_Nurse_EmployeeID REFERENCES Nurse(EmployeeID),
  PRIMARY KEY(Patient, Procedure, Stay, Date)
);

In [ ]:
%%sql
INSERT INTO Physician VALUES(1,'John Dorian','Staff Internist',111111111);
INSERT INTO Physician VALUES(2,'Elliot Reid','Attending Physician',222222222);
INSERT INTO Physician VALUES(3,'Christopher Turk','Surgical Attending Physician',333333333);
INSERT INTO Physician VALUES(4,'Percival Cox','Senior Attending Physician',444444444);
INSERT INTO Physician VALUES(5,'Bob Kelso','Head Chief of Medicine',555555555);
INSERT INTO Physician VALUES(6,'Todd Quinlan','Surgical Attending Physician',666666666);
INSERT INTO Physician VALUES(7,'John Wen','Surgical Attending Physician',777777777);
INSERT INTO Physician VALUES(8,'Keith Dudemeister','MD Resident',888888888);
INSERT INTO Physician VALUES(9,'Molly Clock','Attending Psychiatrist',999999999);

INSERT INTO Department VALUES(1,'General Medicine',4);
INSERT INTO Department VALUES(2,'Surgery',7);
INSERT INTO Department VALUES(3,'Psychiatry',9);

INSERT INTO Affiliated_With VALUES(1,1,1);
INSERT INTO Affiliated_With VALUES(2,1,1);
INSERT INTO Affiliated_With VALUES(3,1,0);
INSERT INTO Affiliated_With VALUES(3,2,1);
INSERT INTO Affiliated_With VALUES(4,1,1);
INSERT INTO Affiliated_With VALUES(5,1,1);
INSERT INTO Affiliated_With VALUES(6,2,1);
INSERT INTO Affiliated_With VALUES(7,1,0);
INSERT INTO Affiliated_With VALUES(7,2,1);
INSERT INTO Affiliated_With VALUES(8,1,1);
INSERT INTO Affiliated_With VALUES(9,3,1);

INSERT INTO Procedure VALUES(1,'Reverse Rhinopodoplasty',1500.0);
INSERT INTO Procedure VALUES(2,'Obtuse Pyloric Recombobulation',3750.0);
INSERT INTO Procedure VALUES(3,'Folded Demiophtalmectomy',4500.0);
INSERT INTO Procedure VALUES(4,'Complete Walletectomy',10000.0);
INSERT INTO Procedure VALUES(5,'Obfuscated Dermogastrotomy',4899.0);
INSERT INTO Procedure VALUES(6,'Reversible Pancreomyoplasty',5600.0);
INSERT INTO Procedure VALUES(7,'Follicular Demiectomy',25.0);

INSERT INTO Patient VALUES(100000001,'John Smith','42 Foobar Lane','555-0256',68476213,1);
INSERT INTO Patient VALUES(100000002,'Grace Ritchie','37 Snafu Drive','555-0512',36546321,2);
INSERT INTO Patient VALUES(100000003,'Random J. Patient','101 Omgbbq Street','555-1204',65465421,2);
INSERT INTO Patient VALUES(100000004,'Dennis Doe','1100 Foobaz Avenue','555-2048',68421879,3);

INSERT INTO Nurse VALUES(101,'Carla Espinosa','Head Nurse',1,111111110);
INSERT INTO Nurse VALUES(102,'Laverne Roberts','Nurse',1,222222220);
INSERT INTO Nurse VALUES(103,'Paul Flowers','Nurse',0,333333330);

INSERT INTO Appointment VALUES(13216584,100000001,101,1,'2008-04-24 10:00','2008-04-24 11:00','A');
INSERT INTO Appointment VALUES(26548913,100000002,101,2,'2008-04-24 10:00','2008-04-24 11:00','B');
INSERT INTO Appointment VALUES(36549879,100000001,102,1,'2008-04-25 10:00','2008-04-25 11:00','A');
INSERT INTO Appointment VALUES(46846589,100000004,103,4,'2008-04-25 10:00','2008-04-25 11:00','B');
INSERT INTO Appointment VALUES(59871321,100000004,NULL,4,'2008-04-26 10:00','2008-04-26 11:00','C');
INSERT INTO Appointment VALUES(69879231,100000003,103,2,'2008-04-26 11:00','2008-04-26 12:00','C');
INSERT INTO Appointment VALUES(76983231,100000001,NULL,3,'2008-04-26 12:00','2008-04-26 13:00','C');
INSERT INTO Appointment VALUES(86213939,100000004,102,9,'2008-04-27 10:00','2008-04-21 11:00','A');
INSERT INTO Appointment VALUES(93216548,100000002,101,2,'2008-04-27 10:00','2008-04-27 11:00','B');

INSERT INTO Medication VALUES(1,'Procrastin-X','X','N/A');
INSERT INTO Medication VALUES(2,'Thesisin','Foo Labs','N/A');
INSERT INTO Medication VALUES(3,'Awakin','Bar Laboratories','N/A');
INSERT INTO Medication VALUES(4,'Crescavitin','Baz Industries','N/A');
INSERT INTO Medication VALUES(5,'Melioraurin','Snafu Pharmaceuticals','N/A');

INSERT INTO Prescribes VALUES(1,100000001,1,'2008-04-24 10:47',13216584,'5');
INSERT INTO Prescribes VALUES(9,100000004,2,'2008-04-27 10:53',86213939,'10');
INSERT INTO Prescribes VALUES(9,100000004,2,'2008-04-30 16:53',NULL,'5');

INSERT INTO Block VALUES(1,1);
INSERT INTO Block VALUES(1,2);
INSERT INTO Block VALUES(1,3);
INSERT INTO Block VALUES(2,1);
INSERT INTO Block VALUES(2,2);
INSERT INTO Block VALUES(2,3);
INSERT INTO Block VALUES(3,1);
INSERT INTO Block VALUES(3,2);
INSERT INTO Block VALUES(3,3);
INSERT INTO Block VALUES(4,1);
INSERT INTO Block VALUES(4,2);
INSERT INTO Block VALUES(4,3);

INSERT INTO Room VALUES(101,'Single',1,1,0);
INSERT INTO Room VALUES(102,'Single',1,1,0);
INSERT INTO Room VALUES(103,'Single',1,1,0);
INSERT INTO Room VALUES(111,'Single',1,2,0);
INSERT INTO Room VALUES(112,'Single',1,2,1);
INSERT INTO Room VALUES(113,'Single',1,2,0);
INSERT INTO Room VALUES(121,'Single',1,3,0);
INSERT INTO Room VALUES(122,'Single',1,3,0);
INSERT INTO Room VALUES(123,'Single',1,3,0);
INSERT INTO Room VALUES(201,'Single',2,1,1);
INSERT INTO Room VALUES(202,'Single',2,1,0);
INSERT INTO Room VALUES(203,'Single',2,1,0);
INSERT INTO Room VALUES(211,'Single',2,2,0);
INSERT INTO Room VALUES(212,'Single',2,2,0);
INSERT INTO Room VALUES(213,'Single',2,2,1);
INSERT INTO Room VALUES(221,'Single',2,3,0);
INSERT INTO Room VALUES(222,'Single',2,3,0);
INSERT INTO Room VALUES(223,'Single',2,3,0);
INSERT INTO Room VALUES(301,'Single',3,1,0);
INSERT INTO Room VALUES(302,'Single',3,1,1);
INSERT INTO Room VALUES(303,'Single',3,1,0);
INSERT INTO Room VALUES(311,'Single',3,2,0);
INSERT INTO Room VALUES(312,'Single',3,2,0);
INSERT INTO Room VALUES(313,'Single',3,2,0);
INSERT INTO Room VALUES(321,'Single',3,3,1);
INSERT INTO Room VALUES(322,'Single',3,3,0);
INSERT INTO Room VALUES(323,'Single',3,3,0);
INSERT INTO Room VALUES(401,'Single',4,1,0);
INSERT INTO Room VALUES(402,'Single',4,1,1);
INSERT INTO Room VALUES(403,'Single',4,1,0);
INSERT INTO Room VALUES(411,'Single',4,2,0);
INSERT INTO Room VALUES(412,'Single',4,2,0);
INSERT INTO Room VALUES(413,'Single',4,2,0);
INSERT INTO Room VALUES(421,'Single',4,3,1);
INSERT INTO Room VALUES(422,'Single',4,3,0);
INSERT INTO Room VALUES(423,'Single',4,3,0);

INSERT INTO On_Call VALUES(101,1,1,'2008-11-04 11:00','2008-11-04 19:00');
INSERT INTO On_Call VALUES(101,1,2,'2008-11-04 11:00','2008-11-04 19:00');
INSERT INTO On_Call VALUES(102,1,3,'2008-11-04 11:00','2008-11-04 19:00');
INSERT INTO On_Call VALUES(103,1,1,'2008-11-04 19:00','2008-11-05 03:00');
INSERT INTO On_Call VALUES(103,1,2,'2008-11-04 19:00','2008-11-05 03:00');
INSERT INTO On_Call VALUES(103,1,3,'2008-11-04 19:00','2008-11-05 03:00');

INSERT INTO Stay VALUES(3215,100000001,111,'2008-05-01','2008-05-04');
INSERT INTO Stay VALUES(3216,100000003,123,'2008-05-03','2008-05-14');
INSERT INTO Stay VALUES(3217,100000004,112,'2008-05-02','2008-05-03');

INSERT INTO Undergoes VALUES(100000001,6,3215,'2008-05-02',3,101);
INSERT INTO Undergoes VALUES(100000001,2,3215,'2008-05-03',7,101);
INSERT INTO Undergoes VALUES(100000004,1,3217,'2008-05-07',3,102);
INSERT INTO Undergoes VALUES(100000004,5,3217,'2008-05-09',6,NULL);
INSERT INTO Undergoes VALUES(100000001,7,3217,'2008-05-10',7,101);
INSERT INTO Undergoes VALUES(100000004,4,3217,'2008-05-13',3,103);

INSERT INTO Trained_In VALUES(3,1,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,2,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,5,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,6,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(3,7,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(6,2,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(6,5,'2007-01-01','2007-12-31');
INSERT INTO Trained_In VALUES(6,6,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,1,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,2,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,3,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,4,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,5,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,6,'2008-01-01','2008-12-31');
INSERT INTO Trained_In VALUES(7,7,'2008-01-01','2008-12-31');

[Solution](https://en.wikibooks.org/wiki/SQL_Exercises/The_Hospital)

(1) Obtain the names of all physicians that have performed a mediacl procedure they have never been certified to perform.

(2)Same as the previous query, but include the following information in the results: Physician name, name of procedure, date when the procedure was carried out, name of the patient the procddure was carried out on.

(3) Obtain the names of all physicians that have performed a medical procedure that the are certified to perform, but such that the procedure was done at a date (Undergoes.Date) after the physician's certification expired (Trained_In.Certification).

(4) Same as the previous query, but include the following information in the results: Physician name, name of procedure, date when the procedure was carried out, name of the patient the procedure was carried out on, and date when the certification expired.

(5) Obtain the information for appointments where a patient met with a physician other than his/her primary care physician. Show the following information: Patient name, physician name, nurse name (if any), start and end time of appointment, examination room, and the name of the patient's primary care physician.

(6) The Patient field in Undergoes is redundant, since we can obtain it from the Stay table. There are no constraints in force to prevent inconsistencies between these two tables. More specifically, the Undergoes table may include a row where the patient ID does not match the one we would obtain from the Stay table through the Undergoes.Stay foreign key. Select all rows from Undergoes that exhibit this inconsistency.

(7) Obtain the names of all the nurses who have ever been on call for room 123.

(8) The hospital has several examination rooms where appointments take place. Obtain the number of appointments that have taken place in each examination room.

(9) Obtain the names of all patients (also include, for each patient, the name of the patient's primary care physician), such that \emph{all} the following are true:

The patient has been prescribed some medication by his/her primary care physician.
The patient has undergone a procedure with a cost larger that $5,000
The patient has had at least two appointment where the nurse who prepped the appointment was a registered nurse.
The patient's primary care physician is not the head of any department.